*** Settings ***
Resource  base_keywords.robot
Suite Setup    Підготувати клієнт для користувача
*** Variables ***
@{USED_ROLES}  admin  user

*** Test Cases ***
Тест створити критерію
  Можливість cтворити критерію  admin
  Перевірити створену критерію  admin
  Перевірити створену критерію  user

Тест редагувати критерію
  Можливість змінити критерію  admin
  Перевірити редагування критерії  admin
  Перевірити редагування критерії  user

Тест перевірити кількість критерій
  Можливість переглядати список критеріїв  admin
  Перевірити список критерій  admin
  Перевірити список критерій  user

Тест видалення критерії
  Можливість видаляти критерію  admin
  Перевірити чи критерія видалена  admin
  Перевірити чи критерія видалена  user


Тест на відсутність можливості видалити критерію
  Можливість cтворити критерію  admin
  Перевірити відсутність доступу користувача до видалення критерії  user

Тест на відсутність можливості користувачем створити критерію
  Перевірити відсутність доступу користувача до створення критерії  user

Тест на відсутність доступу користувачем змінити критерію
  Перевірити відсутність доступу користувача до змінити критерію  user
